# ExternalFileReference Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalFileReference Properties
ExternalFileReference Class See Also
---
The ExternalFileReference type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExternalFileReferenceType | The type of external file which this object references. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| PathType | The path type of the link (relative, absolute, or server). |

# See Also
ExternalFileReference Class
Autodesk.Revit.DB Namespace